let handler = async (m, { conn }) => {

m.reply(`‌‌   *┇━ 『ترحيب👋🏻ستورم』 ━┇*
*⌬━• ━• ━• ━• ━• ━•━⌬*
*┇♦┇اللقـب『』*
*┇🎌┇الانمـي『』*
*┇📧┇المنشـن『』*
*┇👤┇المسـؤول『』*
*⌬━• ━• ━• ━• ━• ━•━⌬*
*⊰انرتنــا وادخلـت السعـادة عل قلـوبنا اهلا بـك في بيتـك الجـديد وعائلتـك الجـديده نرجـو لك وقتـا سعيدا معنـا ستـورم تـرحب بـك في اي وقـت واي زمـان🌗🍃🪷⊱*
*⌬━• ━• ━• ━• ━• ━•━⌬*
*⌬تــوقيــع المملكــه✍🏻*
*⎔─ ━•* 𝐖.𝐒.𝐙『🔱』𝐒𝐓𝐎𝐑𝐌`)
}
handler.help = ['ترحيب']
handler.tags = ['المجموعات']
handler.command = /^(الترحيب|ترحيب)$/i
handler. admin: true; 

export default handler;
