let handler = async (m, { conn }) => {

m.reply(`‌‌     • ╌─━┇ *﷽*┇━─╌ •
‌     *『استقبــال🚪ستـــورم』*
‌ *━• ━⎔── ━• ━ ──⎔━• ━* 
‌ *━• ━⎔── ━• ━ ──⎔━• ━* 
*☬↫┊♦┊القــب 『』*
*• ━ ──⎔*
*☬↫┊🎌┊انمــي『』*
*• ━ ──⎔*
*☬↫┊🧑🏻👩🏻┊النــوع『』*
*• ━ ──⎔*
*☬↫┊📧┊طــرف『』*
‌ *━• ━⎔── ━• ━ ──⎔━• ━* 
‌ *━• ━⎔── ━• ━ ──⎔━• ━*
*⌬ ممنــوعات الاستقـبال 📛*
*☬↫ممنــوع الســوالف🚫*
*☬↫ممنـــوع الســب🚫*
*☬↫قضــاء 24 ســاعه دون تعبـئة الاستمــاره 🚫*
‌ *━• ━⎔── ━• ━ ──⎔━• ━* 
‌ *━• ━⎔── ━• ━ ──⎔━• ━*
‌            *⌬ توقيــع النقـــابه✒️*
‌           *𓆩𝐖.𝐒.𝐙『🔱』𝐒𝐓𝐎𝐑𝐌𓆪*`)
}
handler.help = ['استماره']
handler.tags = ['infobot']
handle .command = /^(استماره)$/i

export default handler;
