let handler = async (m, { conn }) => {
    const name = conn.getName(m.sender);
    let videoUrl = 'https://telegra.ph/file/18db853002c9bd7be317c.mp4';
    let tagUser = '@' + m.sender.split("@s.whatsapp.net")[0];
    let more = String.fromCharCode(8206);
    let teks = `${pickRandom([`
*‌     ╭──𓆩♕𝙎𝙃𝙄𝙆𝘼🐥ᵇᵒᵗ♕𓆪──╮*
*⌬ اهلا ياحـب معـك:-*
*⎊『♕شيكـا 🐥 بوت♕』*
*• ━ ──⎔*
*⌬ معلومـات البــوت:-* 
*☬↫الاسم👤*
*『شيكـا🐥』*
*☬↫المطـور👨🏻‍💻*
*『شيكا🐥 - +201005603546』*
*☬↫تابـع لـ⚜️*
*『نقــابة ستــورم🔱』*
*〄━━━⌬『الاوامــر📜』⌬━━━〄*


*┇ــــــــــــــــــــــ『🐥』ــــــــــــــــــــ┇*
*┇• ━ ──⎔ 『المجمــوعه 🔮』*

*☬↫〔منشن ✨〕*
*☬↫〔مخفي 👻〕*
*☬↫〔ترقيه ⏫〕*
*☬↫〔اعفاء ⏬〕*
*☬↫〔طرد ➖〕*
*☬↫〔اضافه ➕〕*
*☬↫〔الادمن 🛡〕*
*☬↫〔الجروب قفل 🔐〕*
*☬↫〔الجروب فتح 🔓〕*
*☬↫〔تغيير-الاسم 💠〕*
*┇• ━ ──⎔ 『الاعضاء 🧑‍🧑‍🧒‍🧒』*
*☬↫〔رابطي 🔗〕*
*☬↫〔منشني 👤〕*
*☬↫〔بروفايل+@ 🖼〕*
*☬↫〔بروفايلي 🧧〕*
*☬↫〔لقبني 🪪〕*
*☬↫〔اشاره 👆🏻〕*
*☬↫〔اختصار ◽〕*
*┇• ━ ──⎔『بوت ai🖲️』*

*☬↫〔شيكا 🐥〕*
*☬↫〔بوت 🤖〕*
*☬↫〔دحيح 🥸〕*
*☬↫〔بوروتو 🥷🏻〕*
*☬↫〔الطقس 🌦〕*
*☬↫〔تخيل 🪄〕*
*┇• ━ ──⎔ 『الالعـاب 🎮』*

*☬↫〔كوره ⚽〕*
*☬↫〔سيارات 🚘〕*
*☬↫〔علم 🏳〕*
*☬↫〔احزر 🤔〕*
*☬↫〔عين 👁〕*
*☬↫〔خمن 🧐〕*
*☬↫〔سؤال ❓〕*
*☬↫〔تفكيك 🔻🔺〕*
*☬↫〔رياضه 🧮〕*
*☬↫〔زواج 🤵🏻👰🏻〕*
*☬↫〔طلاق 👨🏻‍⚖️👩🏻‍⚖️〕*
*☬↫〔صداقه 🧑🏻👩🏻〕*
*☬↫〔حب 👩‍❤️‍👨〕*
*☬↫〔زوجني 🫂〕*
*☬↫〔اكس ❌⭕〕*
*┇• ━ ──⎔ 『الترفيــه 📍』*

*☬↫〔تاج 👀〕*
*☬↫〔هو 🫵🏻〕*
*☬↫〔شخصيه 💅〕*
*☬↫〔توب 🔟〕*
*☬↫〔هل ❓〕*
*☬↫〔لو ❗〕*
*☬↫〔خروف 🐑〕*
*☬↫〔حكمه ✨〕*
*☬↫〔نصيحه 🧙🏻‍♂️〕*
*☬↫〔صراحه 🕵🏻‍♂️〕*
*☬↫〔اقتباس 🪽〕*
*☬↫〔بوستات 💖〕*
*☬↫〔فزوره 🧠〕*
*☬↫〔بيحبني 🌚〕*
*☬↫〔بيكرهني 💔〕*
*☬↫〔جمال 🫦〕*
*☬↫〔قدوتي 👨🏻‍🎓〕*
*┇• ━ ──⎔ 『التحميــل ♻️』*

*☬↫〔يوتيوب 🔆〕*
*☬↫〔ايديت🎞〕*
*☬↫〔تطبيق 🪀〕*
*☬↫〔اغنيه 🎼〕*
*☬↫〔شغل 🪩〕*
*☬↫〔صوره 🖼〕*
*☬↫〔بينت 🅿️〕*
*☬↫〔فيد-فيس 🎦〕*
*☬↫〔تطقيم 👱🏻‍♀️👱🏻‍♂️〕*
*☬↫〔ميسي 💎〕*
*☬↫〔رونالدو 👑〕*
*┇• ━ ──⎔ 『صور-ai🩻』 ☬↫〔تخيل 🪄〕*

*☬↫〔فلتره 🀄〕*
*☬↫〔فلتر-الوان 🎴〕*
*┇• ━ ──⎔ 『التحــويل 🔄』*

*☬↫〔ملصق 🃏〕*
*☬↫〔ستيك 🪩〕*
*☬↫〔دمج 🤡〕*
*┇• ━ ──⎔ 『الديــن 🕌』*

*☬↫〔الله 9️⃣9️⃣〕*
*☬↫〔قران 📖〕*
*☬↫〔اياتي 🕋〕*
*┇• ━ ──⎔ 『انمــي 🎌』*

*☬↫〔انمي-سيرش 🔍〕*
*☬↫〔انمي-ستوري ⏹〕*
*☬↫〔فصل-النخبه ❄〕*
*☬↫〔دراغون-بول 🐲〕*
*☬↫〔لوفي 👒〕*
*☬↫〔هنتر 🕸〕*
*☬↫〔جوجيتسو 👹〕*
*☬↫〔بنت انمي〕*
*☬↫〔وايفو 🔥〕*
*┇• ━ ──⎔ 『البنك 🏦』*
*『البنـك غيـر مكتـمل اتمنـا تفهـم الامـر』*
*☬↫〔لفل ⏭️〕*
*☬↫〔يومي 🌓〕*
*☬↫〔اسبوعي ☄️〕*
*☬↫〔هجوم 🥷〕*
*☬↫〔الماس 💎〕*
*☬↫〔اضف-الناس ➕💎〕*
*☬↫〔اضف-اكسبي ➕❌🅿️〕*
*☬↫〔البنك〕*

*┇• ━ ──⎔ 『المطــور 👨🏻‍💻』*

*☬↫〔المطور 👨🏻‍💻〕*
*☬↫〔انستا-المطور ✴️〕*
*☬↫〔ابلاغ 🗣〕*
*☬↫〔الدخول-لمجموعه🚪〕*
*☬↫〔حضرالشات 🔏〕*
*☬↫〔الغاءحظرالشات 🔑〕*
*⎊╎———————————╎⎊*
*⌬ البــوت قيــد التعديل والتطــوير👨🏻‍💻*
*⌬ البــوت قيــد التعديل والتطــوير👨🏻‍💻*`])}`.trim();

    conn.sendMessage(m.chat, {
        video: { url: videoUrl },
        caption: teks,
        gifPlayback: true,
        gifAttribution: 0
    }, { quoted: m });
};

handler.command = ['menu', 'help', 'h', 'اوامر', 'مهام', 'الاوامر', 'المهام'];

export default handler;

function pickRandom(list) {
    return list[Math.floor(Math.random() * list.length)];
}
