let handler = async (m, { conn }) => {

m.reply(`‌‌ *_⌬تعلن مملكة ستورم عن فعالية🔮_*
*‌             『ديـث📓نــوت』*
*⎔── ━•شــرح الفعــاليه🎐*
*⎊—————————————*
*┇↫يملك كل مشـارك مذكـره ┇واحـده📓*
*┇↫وعليــه الفــوز في المســابقات ┇مثل ┇(صور-كتابه-الخ)🔮*
*┇↫وعندمــا يفــوز يستطيــع اختيــار ┇احــدالمشــاركيـن ┇لاخـراجـه مـن اللعبــه🗡*
*┇↫وعلــى المتســابقيــن اخــراج ┇بعضـهــم حـتــا يتبـقــا*
*┇المتـســابق الاخيـــر🥇*
*⎊—————————————*
*⎔── ━ •بـدا الفعـاليه🔮*
*⎊—————————————*
*┇🎙┇الـمـــقــدم『』*
*┇👥┇المشاركين『』*
*┇⏱️┇الــوقـــــت『』*
*┇⁉️┇الاســـالـــه『』*
*⎊—————————————*‌
        *⌬ توقيـــع النقـــابه✒️*
‌        *𓆩* 𝐖.𝐒.𝐙『🔱』𝐒𝐓𝐎𝐑𝐌 *𓆪*`)
}
handler.help = ['الفعاليات']
handler.tags = ['infobot']
handler.command = /^(ف-ديث-نوت)$/i

export default handler;
