let handler = async (m, { conn }) => {

m.reply(` *_⎊ بــدايـة فعــاليــة القـــلاع🫴🏻_*
*⌬━• ━• ━• ━• ━• ━•━⌬*
*┇🎙┇المقــدم『』*
*⌬━• ━• ━• ━• ━• ━•━⌬*
‌             *الفعـاليـه✨🏰*
*المشاركين 👥*     *القـلاع🏯*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*┇❗┇『』* 
*『🏰🏰🏰🏰🏰』*
*⌬━• ━• ━• ━• ━• ━•━⌬*
*توقيــع المملكـه✒️:*
*⌬┇━─╌ •* 𝙒.𝙎.𝙕『🔱』𝙎𝙏𝙊𝙍𝙈`)
}
handler.help = ['الفعاليات']
handler.tags = ['infobot']
handler.command = /^(ف-القلاع2)$/i

export default handler;
