let handler = async (m, { conn }) => {

m.reply(`‌‌ *_⌬تعلن مملكة ستورم عن فعالية🔮_*
*‌             『القـــ🏰ــلاع』*
*⎔── ━•شــرح الفعــاليه🎐*
*⎊—————————————*
*⌬⊱ لكل مشارك 5 قلعـات ويجب عليه ان يجاوب عل الاسئله والتي تكون ( كتابه - صور- تخمين شخصيه -الخ...)*
*ان فزت فاعليك ان تقوم باختيار شخص مشارك ليتم هدم قلعه له وعندما يتم هدم جميع القلاع يتم اقصائه🤝🏻* 
*⎊—————————————*
*⎔── ━ •بـدا الفعـاليه🔮*
*⎊—————————————*
*┇🎙┇الـمـــقــدم『』*
*┇👥┇المشاركين『』*
*┇⏱️┇الــوقـــــت『』*
*┇⁉️┇الاســـالـــه『』*
*⎊—————————————*‌
        *⌬ توقيـــع الممـلكه✒️*
‌        *𓆩* 𝐖.𝐒.𝐙『🔱』𝐒𝐓𝐎𝐑𝐌 *𓆪*`)
}
handler.help = ['الفعاليات']
handler.tags = ['infobot']
handler.command = /^(ف-القلاع)$/i

export default handler;